mhoikka/RCtransmitter_stm32f0/src/Peripheral_Init.c
  // Enable pins to control NMOS H-Bridge
  GPIO_InitTypeDef GPIO_InitStruct;
  GPIO_InitStruct.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_3 | GPIO_Pin_4;
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz; // High speed
  GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_DOWN;
  GPIO_Init(GPIOB, &GPIO_InitStruct);

  GPIO_InitTypeDef GPIO_InitStruct2;
  GPIO_InitStruct2.GPIO_Pin = GPIO_Pin_11;
  GPIO_InitStruct2.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStruct2.GPIO_Speed = GPIO_Speed_50MHz; // High speed
  GPIO_InitStruct2.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStruct2.GPIO_PuPd = GPIO_PuPd_DOWN;
  GPIO_Init(GPIOC, &GPIO_InitStruct2);

  GPIO_InitTypeDef GPIO_InitStruct3;
  GPIO_InitStruct3.GPIO_Pin = GPIO_Pin_2;
  GPIO_InitStruct3.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStruct3.GPIO_Speed = GPIO_Speed_50MHz; // High speed
  GPIO_InitStruct3.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStruct3.GPIO_PuPd = GPIO_PuPd_DOWN;
  GPIO_Init(GPIOD, &GPIO_InitStruct3);
}

/**
 * * @brief Initializes all of the peripherals necessary to control the servo motors using the STM32 chip
 * @retval None
 */
void Servo_Peripherals_Init(){

  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE); // enable clocks for GPIO peripheral
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOC, ENABLE);

  // Enable pins to control servos
  GPIO_InitTypeDef GPIO_InitStruct;
  GPIO_InitStruct.GPIO_Pin = GPIO_Pin_13;
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz; // High speed
  GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_DOWN;
  GPIO_Init(GPIOC, &GPIO_InitStruct);

  GPIO_InitStruct.GPIO_Pin = GPIO_Pin_7;
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz; // High speed
  GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_DOWN;
  GPIO_Init(GPIOF, &GPIO_InitStruct);

  // Enable pin to control test diode and remaining servos
  GPIO_InitTypeDef GPIO_InitStruct2;
  GPIO_InitStruct2.GPIO_Pin = GPIO_Pin_12|GPIO_Pin_11|GPIO_Pin_10|GPIO_Pin_2; // Diode pin and L-R elevator control pins
  GPIO_InitStruct2.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStruct2.GPIO_Speed = GPIO_Speed_50MHz; // High speed
  GPIO_InitStruct2.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStruct2.GPIO_PuPd = GPIO_PuPd_DOWN;
  GPIO_Init(GPIOB, &GPIO_InitStruct2);
}

/**
 * @brief Tests the servo motor, TODO add support for changing angle of servo arm as well
 * @param angle In range 0-4 inclusive and specifies the angle of the servo motor arm by the equation 45 * angle, with units of degrees
 * Note that two of the servo motors used are different and don't need to exceed the specified PWM time spans to fire to the specified angle, as the SG90 do
 */
void DriveServoControl(uint8_t angle){ // For testing purposes only, moves all servos to same angle and resets them to 0 degrees after 2 seconds
  GPIO_SetBits(GPIOB, GPIO_Pin_12); // Turn on test diode to confirm setup function worked
  uint32_t time_on = 0;
  for(int i = 0; i < 100; i++){ // TODO test how fast loaded arm moves, unloaded arm is rated to move at 0.09 s + 0.01 s/60 degrees at 4.8 V so I gave it 150 ms here
    GPIO_SetBits(GPIOC, GPIO_Pin_13); // LFlap // Servo uses PWM to control angle of arm
    GPIO_SetBits(GPIOF, GPIO_Pin_7); // Rflap
    GPIO_SetBits(GPIOB, GPIO_Pin_2); // Lelevator
    GPIO_SetBits(GPIOB, GPIO_Pin_11); // Relevator
    GPIO_SetBits(GPIOB, GPIO_Pin_10); // Rudder
    
    time_on = 800 + angle * 500; // in microseconds
    delay_microseconds(time_on, NULL); // exceeds 1000 or 1500 ms (45-90 degree angle for servo arm) as specified to ensure motor operates
    GPIO_ResetBits(GPIOC, GPIO_Pin_13); // LFlap 
    GPIO_ResetBits(GPIOF, GPIO_Pin_7); // Rflap
    GPIO_ResetBits(GPIOB, GPIO_Pin_2); // Lelevator
    GPIO_ResetBits(GPIOB, GPIO_Pin_11); // Relevator
    GPIO_ResetBits(GPIOB, GPIO_Pin_10); // Rudder
    delay_microseconds(20000 - time_on, NULL);
  }  
  for(int i = 0; i < 100; i++){ // TODO test how fast loaded arm moves, unloaded arm is rated to move at 0.09 s + 0.01 s/60 degrees at 4.8 V so I gave it 150 ms here
    GPIO_SetBits(GPIOC, GPIO_Pin_13); // LFlap // Servo uses PWM to control angle of arm
    GPIO_SetBits(GPIOF, GPIO_Pin_7); // Rflap
    GPIO_SetBits(GPIOB, GPIO_Pin_2); // Lelevator
    GPIO_SetBits(GPIOB, GPIO_Pin_11); // Relevator
    GPIO_SetBits(GPIOB, GPIO_Pin_10); // Rudder
    
    time_on = 800 + 0 * 500; // in microseconds
    delay_microseconds(time_on, NULL); // exceeds 1000 or 1500 ms (45-90 degree angle for servo arm) as specified to ensure motor operates
    GPIO_ResetBits(GPIOC, GPIO_Pin_13); // LFlap 
    GPIO_ResetBits(GPIOF, GPIO_Pin_7); // Rflap
    GPIO_ResetBits(GPIOB, GPIO_Pin_2); // Lelevator
    GPIO_ResetBits(GPIOB, GPIO_Pin_11); // Relevator
    GPIO_ResetBits(GPIOB, GPIO_Pin_10); // Rudder
    delay_microseconds(20000 - time_on, NULL);
  } 
}

/**
 * @brief Enables the ADC for the battery voltage measurement pin
 * @param None
 * @retval None
 */
void enableADC_batteryvoltagesense(){
  GPIO_InitTypeDef GPIO_InitStruct;
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOC, ENABLE); // enable clocks for GPIO peripheral 
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE); // enable clocks for ADC peripheral
  // Configure PC0 as analog input for battery voltage measurement
  GPIO_InitStruct.GPIO_Pin = GPIO_Pin_0; // TODO change this pin
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AN;
  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStruct.GPIO_OType = GPIO_OType_PP; // TODO check these settings
  GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOC, &GPIO_InitStruct);
}

/**
 * @brief Initializes the ADC1 peripheral for battery voltage measurement
 * @retval None
 */
void ADCPeripherals_Init(){
  // Set up ADC10, ADC11, and ADC12 for joystick voltage measurement
  ADC_InitTypeDef ADC_InitStruct;
  ADC_InitStruct.ADC_Resolution = ADC_Resolution_12b;
  ADC_InitStruct.ADC_ContinuousConvMode = DISABLE;
  ADC_InitStruct.ADC_ExternalTrigConvEdge = ADC_ExternalTrigConvEdge_None;
  ADC_InitStruct.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T1_CC4;
  ADC_InitStruct.ADC_DataAlign = ADC_DataAlign_Right;
  ADC_InitStruct.ADC_ScanDirection = ADC_ScanDirection_Upward;
  ADC_Init(ADC1, &ADC_InitStruct);
}

/**
 * @brief Takes a single ADC reading from ADC10, ADC11, and ADC12
 * @retval 3 12 bit ADC reading in unsigned integer format, in a 16 bit integer package padded with 0s on the MSB side
 */
uint16_t * ADC_take_Readings(){
  // Take ADC readings from ADC10, ADC11, and ADC12
  static uint16_t adc_readings[3];

  // make sure ADC peripheral clock was enabled earlier:
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE); // safe to call if already enabled

  // Enable ADC and wait until ADEN is set
  ADC_Cmd(ADC1, ENABLE);
  while (ADC_GetFlagStatus(ADC1, ADC_FLAG_ADEN) == RESET) {
    /* wait for ADC ready */
  }

  GPIO_InitTypeDef GPIO_InitStruct;
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOC, ENABLE); // enable clocks for GPIO peripheral 
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE); // enable clocks for ADC peripheral
  // Configure PC0 as analog input for joystick voltage measurement
  GPIO_InitStruct.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1|GPIO_Pin_2; 
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AN;
  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStruct.GPIO_OType = GPIO_OType_PP; // TODO check these settings
  GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOC, &GPIO_InitStruct);

  ADC_ChannelConfig(ADC1, ADC_Channel_10, ADC_SampleTime_239_5Cycles);
  ADC_StartOfConversion(ADC1);
  while (ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET);
  adc_readings[0] = ADC_GetConversionValue(ADC1);
  
  ADC_ClearFlag(ADC1, ADC_FLAG_EOC);
  delay_microseconds(32, NULL);

