mhoikka/RCtransmitter_stm32f0/src/Peripheral_Init.c
  // Wait until bus is idle
  while (I2C1->ISR & I2C_ISR_BUSY);

  // Clear STOP flag from previous transfer
  I2C1->ICR = I2C_ICR_STOPCF;

  // Configure transfer (WRITE, 1 byte)
  I2C1->CR2 =
      (i2c_address << 1) |           // Slave address
      (1 << 16)| 
      I2C_CR2_START;                 // Generate START


  // Wait for TXIS or NACK
  while (!(I2C1->ISR & (I2C_ISR_TXIS | I2C_ISR_NACKF)));

  if (I2C1->ISR & I2C_ISR_NACKF) {
      I2C1->ICR = I2C_ICR_NACKCF;
      return i2c_data;
  }

  // Send data
  I2C1->TXDR = reg_address;

  // Wait for transfer complete
  while (!(I2C1->ISR & (I2C_ISR_TC | I2C_ISR_NACKF))); // TODO Should check for NACK here too? Not sure. Do I need to check for TC when reading right afterwards?

  if (I2C1->ISR & I2C_ISR_NACKF) {
      I2C1->ICR = I2C_ICR_NACKCF;
      return i2c_data;
  }
  
  // Configure transfer for reading
  I2C1->CR2 =
      (i2c_address << 1) |           // Slave address
      (numbytes << 16)|
      I2C_CR2_RD_WRN |              // Read mode
      I2C_CR2_START  |              // Generate START
	    I2C_CR2_AUTOEND;
  
  // Wait for RXNE or NACK 'numbytes' times and fill the data array, returning early if NACK received
  for(int i = 0; i < numbytes; i++){
    while (!(I2C1->ISR & (I2C_ISR_RXNE | I2C_ISR_NACKF)));
    if (I2C1->ISR & I2C_ISR_NACKF) {
      I2C1->ICR = I2C_ICR_NACKCF;
      // Repopulate array with error data
      for(int i = 0; i < numbytes; i++){
        i2c_data[i] = 0xFF;
      }
      return i2c_data; 
    }
    // Read data received
    i2c_data[i] = I2C1 -> RXDR;
  }
  
  // Wait for STOP to finish
  while (!(I2C1->ISR & I2C_ISR_STOPF));
  I2C1->ICR = I2C_ICR_STOPCF;
  
  return i2c_data;
}

void nrf24_write_register(uint8_t reg, uint8_t value) {
    uint8_t txData[2]; // Transmit data buffer

    // Prepare command to write (register address with write command prefix)
    txData[0] = reg | WRITE_COMMAND; // Write command
    txData[1] = value;      // Data to write

    // Set CSN low to start communication
    set_nrf24_SPI_CSN(0);
    
    
    // Start SPI transmission
    for (int i = 0; i < 2; i++) {
        // Transmit byte
        *(__IO uint8_t*)(&SPI1->DR) = txData[i]; 

        // Wait until transmission is complete
        while (!(SPI1->SR & SPI_SR_RXNE)); // Wait until receive buffer is not empty

        // Read received byte (not used, but necessary to complete the transaction) 
        (void)SPI1->DR; 
    }

    // Set CSN high to end communication
    set_nrf24_SPI_CSN(1);
}

/** 
* @brief: Writes data to a register
* @param: reg register to write to
* @param: values array of uint8_t data to be transmitted
* @param: num_bytes number of bytes to be transmitted
*/
void nrf24_multiwrite_register(uint8_t reg, uint8_t *values, uint8_t num_bytes) {
    uint8_t txData[num_bytes+1]; // Transmit data buffer

    // Prepare command to write (register address with write command prefix)
    txData[0] = reg | WRITE_COMMAND; // Write command
    memcpy(&txData[1], values, num_bytes); // Copy data to write into buffer

    // Set CSN low to start communication
    set_nrf24_SPI_CSN(0);
    
    // Start SPI transmission
    for (int i = 0; i < num_bytes+1; i++) {
        // Transmit byte
        *(__IO uint8_t*)(&SPI1->DR) = txData[i]; 

        // Wait until transmission is complete
        while (!(SPI1->SR & SPI_SR_RXNE)); // Wait until receive buffer is not empty

        // Read received byte (not used, but necessary to complete the transaction) 
        (void)SPI1->DR; 
    }

    // Set CSN high to end communication
    set_nrf24_SPI_CSN(1);
}

void nrf24_write_command(uint8_t COMMAND) {
    // Set CSN low to start communication
    set_nrf24_SPI_CSN(0);
    
    // Start SPI transmission
	// Transmit byte
	*(__IO uint8_t*)(&SPI1->DR) = COMMAND; 

	// Wait until transmission is complete
	while (!(SPI1->SR & SPI_SR_RXNE)); // Wait until receive buffer is not empty

	// Read received byte (not used, but necessary to complete the transaction) 
	(void)SPI1->DR; 

    // Set CSN high to end communication
    set_nrf24_SPI_CSN(1);
}

uint8_t nrf24_read_register(uint8_t reg) {
    uint8_t txData[2]; // Transmit data buffer
    uint8_t rxData[2]; // Receive data buffer

    // Prepare command to read (register address with read command bit)
    txData[0] = reg | READ_COMMAND; // Read command 
    txData[1] = 0x00; // Dummy byte for clocking out data

    // Set CSN low to start communication
    set_nrf24_SPI_CSN(0);
    
    // Start SPI transmission and reception
    for (int i = 0; i < 2; i++) {
        // Transmit byte
        *(__IO uint8_t*)(&SPI1->DR) = txData[i];

        // Wait until transmission is complete
        while (!(SPI1->SR & SPI_SR_RXNE)); // Wait until receive buffer is not empty

        // Read received byte
        rxData[i] = SPI1->DR; // Read received data
    }

    // Set CSN high to end communication
    set_nrf24_SPI_CSN(1);
    return rxData[1]; // Return the value read from the register
}

uint8_t * nrf24_multiread_register(uint8_t reg, uint8_t num_bytes) {
    uint8_t txData; // Transmit data 
    uint8_t rxData[num_bytes+1]; // Receive data buffer

    // Set CSN low to start communication
    set_nrf24_SPI_CSN(0);
    
    // Start SPI transmission and reception
    for (int i = 0; i < num_bytes + 1; i++) {
        // Transmit byte
		txData = (i == 0) ? (reg | READ_COMMAND) : 0x00;
        *(__IO uint8_t*)(&SPI1->DR) = txData;

        // Wait until transmission is complete
        while (!(SPI1->SR & SPI_SR_RXNE)); // Wait until receive buffer is not empty

        // Read received byte
        rxData[i] = SPI1->DR; // Read received data
    }

    // Set CSN high to end communication
    set_nrf24_SPI_CSN(1);
    return &rxData[1]; // Return the value read from the register TODO fix this pointer so it can't dangle by passing in array from calling function
}

/** 
* @brief: Writes data to the TX FIFO
* @param: value: Array of data to be transmitted
* @param: ack: 1 if the data is to be acknowledged, 0 if not
* @param: len: length of the data to be transmitted
*/
void nrf24_write_TX_payload(uint8_t * value, int ack, int len) {
    uint8_t txData[len+1]; // Transmit data buffer

    // Prepare command to write (register address with write command prefix)
    txData[0] = ack ?  WRITE_PAYLOAD_COMMAND: WRITE_PAYLOAD_NOACK; // Write command
    for (int i = 0; i < len; i++) {
        txData[i+1] = value[i];
    }
    // Set CSN low to start communication
    set_nrf24_SPI_CSN(0);
    
    // Start SPI transmission
    for (int i = 0; i < (len+1); i++) {
        // Transmit byte
        while (!(SPI1->SR & SPI_SR_TXE)); 
        *(__IO uint8_t*)(&SPI1->DR) = txData[i]; 

        // Wait until transmission is complete
        
