mhoikka/RCtransmitter_stm32f0/src/Peripheral_Init.c
  //Set up the GPIO pins
  GPIO_InitTypeDef GPIO_InitStruct_1;
  //Set up the CSN pin
  GPIO_InitStruct_1.GPIO_Pin = GPIO_Pin_10;
  GPIO_InitStruct_1.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStruct_1.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStruct_1.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStruct_1.GPIO_PuPd = GPIO_PuPd_DOWN; 
  GPIO_Init(GPIOA, &GPIO_InitStruct_1);

  GPIO_InitTypeDef GPIO_InitStruct_2;
  //Set up the IRQ pin
  GPIO_InitStruct_2.GPIO_Pin = GPIO_Pin_9;
  GPIO_InitStruct_2.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStruct_2.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStruct_2.GPIO_Mode = GPIO_Mode_IN;
  GPIO_InitStruct_2.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_Init(GPIOA, &GPIO_InitStruct_2);

   GPIO_InitTypeDef GPIO_InitStruct_3;
  //Set up the CE pin
  GPIO_InitStruct_3.GPIO_Pin = GPIO_Pin_8;
  GPIO_InitStruct_3.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStruct_3.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStruct_3.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStruct_3.GPIO_PuPd = GPIO_PuPd_DOWN; 
  GPIO_Init(GPIOA, &GPIO_InitStruct_3);
}

/**
 * @brief Initializes the UART connection for the STM32F030R8
 * @retval None
 */
void UART_Settings_Init(){
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE);

  GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_1);
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_1);

  GPIO_InitTypeDef GPIO_InitStruct;

  GPIO_InitStruct.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_3;
  GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz; 
  GPIO_InitStruct.GPIO_OType = GPIO_OType_PP; 
  GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL; 
  GPIO_Init(GPIOA, &GPIO_InitStruct);


  USART_InitTypeDef USART_InitStruct;
  USART_InitStruct.USART_BaudRate = 9600;
  USART_InitStruct.USART_WordLength = USART_WordLength_8b;
  USART_InitStruct.USART_StopBits = USART_StopBits_1;
  USART_InitStruct.USART_Parity = USART_Parity_No;
  USART_InitStruct.USART_Mode = USART_Mode_Tx;
  USART_InitStruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_Init(USART2, &USART_InitStruct);
  //No synchronous mode yet
  USART_Cmd(USART2, ENABLE);
}


static uint8_t ICM_20948_I2C_ADDRESS = 0x69;
static uint8_t REG_BANK_SEL = 0x7F;
static uint8_t USER_BANK_0 = (0 << 4);
static uint8_t USER_BANK_1 = (1 << 4);
static uint8_t USER_BANK_2 = (2 << 4);
static uint8_t USER_BANK_3 = (3 << 4);

// REGISTER BANK 2
static uint8_t LP_CONFIG = 0x05;
static uint8_t PWR_MGMT_1 = 0x06;
static uint8_t PWR_MGMT_2 = 0x07;
// REGISTER BANK 2
static uint8_t TEMP_CONFIG = 0x53; 
static uint8_t GYRO_SMPLRT_DIV = 0x00;
static uint8_t GYRO_CONFIG_1 = 0x01;
static uint8_t GYRO_CONFIG_2 = 0x02;
static uint8_t ACCEL_SMPLRT_DIV = 0x10;
static uint8_t ACCEL_CONFIG = 0x14;
static uint8_t ACCEL_CONFIG_2 = 0x15;
static uint8_t GYRO_ACCEL_START_REG = 0x2D; // ACCEL_XOUT_H register

static uint8_t MAG_START_REG = 0x11;

  /**
   * @brief Sets up ICM20948 for data collection and puts magnetometer(AK09916) into continuous mode 4 (100 Hz data rate)
   * @param None
   * @retval N0ne
   */
  void ICM20948_init(){
    
    I2C_transmit(0x69, REG_BANK_SEL, USER_BANK_0); // switch to USER BANK 0

    I2C_transmit(0x69, LP_CONFIG, 0x30); // set low power mode for ICM20948 (ACCEL/ GYRO in duty cycle mode)

    I2C_transmit(0x69, PWR_MGMT_1, 0x11); // set low power enable for digital circuitry (does not turn on LP mode, use LP_CONFIG) and auto clock select for ICM20948
    I2C_transmit(0x69, PWR_MGMT_2, 0x00); // enable accelerometer and gyroscope for ICM20948

    I2C_transmit(0x69, REG_BANK_SEL, USER_BANK_2); // switch to USER BANK 2
  
    I2C_transmit(0x69, TEMP_CONFIG, 0x01); // set TEMP_DLPCFG for temperature sensor to 1

    I2C_transmit(0x69, GYRO_SMPLRT_DIV, 0x07); // set gyro sample rate divider to 7 for ICM20948
    I2C_transmit(0x69, GYRO_CONFIG_1, 0x3F); // Set gyro +- range to 2000dps and DLPF 3dB point to 361 Hz, and enable LPF for ICM20948
    I2C_transmit(0x69, GYRO_CONFIG_2, 0x02); // Enable 4x averaging for gyro data for ICM20948

    I2C_transmit(0x69, ACCEL_SMPLRT_DIV, 0x0A); // set accel sample rate divider to 10 for ICM20948
    I2C_transmit(0x69, ACCEL_CONFIG, 0x3F); // Set accel +- range to 16g and DLPF 3dB point to 473 Hz, and enable LPF for ICM20948
    I2C_transmit(0x69, ACCEL_CONFIG_2, 0x00); // Enable 4x averaging for accel data for ICM20948

    I2C_transmit(0x69, REG_BANK_SEL, USER_BANK_0); // switch to USER BANK 0

    // Enable bypass mode for I2C access of internal magnetometer
    I2C_transmit(0x69, 0x0F, 0x02);  // INT_PIN_CFG: BYPASS_EN = 1

    I2C_transmit(0x0C, 0x31, 0x08);  // CNTL2 register = 0x16 (continuous 100 Hz updates to magnetometer data)
    Delay(10); // TODO find out how long the magnetometer needs to start up
  }

  /**
 * @brief Collects ambient data from ICM20948 and puts it into the provided array ICM_data
 * @param None
 * @retval None
 */
  void getICM20948_ACCEL_GYRO_TEMPdata(float * ICM_data){
    static float ACCEL_SENSITIVITY = 2048;
    static float GYRO_SENSITIVITY = 16.4; 
    static float MAG_SENSITIVITY = 0.15;
    static float TEMP_SENSITIVITY = 337.87; 

    // Accelerometer and Gyroscope variables
    uint8_t accel_gyro_data[14];
    float accel_out[3]; //{X,Y,Z}
    float gyro_out[3]; //{X,Y,Z}

    // Thermometer variables
    float temp_out = (((accel_gyro_data[12] << 8) + accel_gyro_data[13] - 0) / TEMP_SENSITIVITY) + 21; // Degrees Celcius

    // Magnetometer variables
    int16_t mag_raw[3];
    float mag_out[3];
    uint8_t buf[6];
    uint8_t new_magdata = 0;
    uint8_t mag_overf = 0;
    uint8_t st1 = 0;
    uint8_t st2 = 0;

      // Read accelerometer and gyroscope data test
    I2C_receive(0x69, GYRO_ACCEL_START_REG, accel_gyro_data, 14); // read ACCEL_XOUT_H register and the following 11 registers for accel and gyro data

    accel_out[0] = ((accel_gyro_data[0] << 8) + accel_gyro_data[1]) / ACCEL_SENSITIVITY * 9.81; // TODO adjust gyro and accelerometer data for temperature drift values
    accel_out[1] = ((accel_gyro_data[2] << 8) + accel_gyro_data[3]) / ACCEL_SENSITIVITY * 9.81; // m/s^2 // TODO reading very high m(309.6 m/s^2), bug?
    accel_out[2] = ((accel_gyro_data[4] << 8) + accel_gyro_data[5]) / ACCEL_SENSITIVITY * 9.81; // m/s^2

    gyro_out[0] = (accel_gyro_data[6] * UINT8_MAX + accel_gyro_data[7]) / GYRO_SENSITIVITY; // Degrees per second
    gyro_out[1] = (accel_gyro_data[8] * UINT8_MAX + accel_gyro_data[9]) / GYRO_SENSITIVITY; // Degrees per second
    gyro_out[2] = (accel_gyro_data[10] * UINT8_MAX + accel_gyro_data[11]) / GYRO_SENSITIVITY; // Degrees per second

    temp_out = (((accel_gyro_data[12] << 8) + accel_gyro_data[13] - 0) / TEMP_SENSITIVITY) + 21; // Degrees Celcius

    // BANK 0: Enable I2C master
    // Should still be in BANK 0
    
    do {
      I2C_receive(0x0C, 0x10, &st1, 1);  // read ST1
    } while (!(st1 & 0x01)); // Wait for DRDY flag
    I2C_receive(0x0C, MAG_START_REG, buf, 6); // 0x0C I2C address is for the internal magnetometer
    I2C_receive(0x0C, 0x18, &st2, 1);  // read ST2 // TODO handle overflow flags here 

    // Now interpret:
    mag_raw[0] = (int16_t)((buf[1] << 8) | buf[0]); // X
    mag_raw[1] = (int16_t)((buf[3] << 8) | buf[2]); // Y
    mag_raw[2] = (int16_t)((buf[5] << 8) | buf[4]); // Z

    // ST1 check (data ready)
    if(!(st1 & 0x01)) {
        // TOD0 No new data; skip using this sample
        new_magdata = 0;
        //return;  
    }

    // ST2 check (overflow)
    if(st2 & 0x08) {
        // TODO Magnetic overflow — discard values
        mag_overf = 1;
        //return;
    }

    mag_out[0] = mag_raw[0] * 0.15f; // uT
    mag_out[1] = mag_raw[1] * 0.15f; // uT
    mag_out[2] = mag_raw[2] * 0.15f; // uT
    
    ICM_data[0] = accel_out[0];
    ICM_data[1] = accel_out[1];
    ICM_data[2] = accel_out[2];
    ICM_data[3] = gyro_out[0];
    ICM_data[4] = gyro_out[1];
    ICM_data[5] = gyro_out[2];
    ICM_data[6] = temp_out;
    ICM_data[7] = mag_out[0];
    ICM_data[8] = mag_out[1];
    ICM_data[9] = mag_out[2];
  }